CapaNegocio/test_ws_cotizacion.py

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <FrecuenciaCotizador xmlns="http://www.estafeta.com/">
      <idusuario>28</idusuario>
      <usuario>28</usuario>
      <contra>lAbeL_K_11</contra>
      <esFrecuencia>false</esFrecuencia>
      <esLista>true</esLista>
      <tipoEnvio>
        <EsPaquete>false</EsPaquete>
        <Largo>0</Largo>
        <Peso>0</Peso>
        <Alto>0</Alto>
        <Ancho>0</Ancho>
      </tipoEnvio>
      <datosOrigen>
        <string>02300</string>
      </datosOrigen>
      <datosDestino>
        <string>02130</string>
      </datosDestino>
    </FrecuenciaCotizador>
  </soap:Body>
</soap:Envelope>



<labelDescriptionListCount xsi:type="ns2:int">1</labelDescriptionListCount>
<login xsi:type="ns2:string">prueba1</login>
<paperType xsi:type="ns2:int">1</paperType>
<password xsi:type="ns2:string">lAbeL_K_11</password>
<quadrant xsi:type="ns2:int">0</quadrant>
<suscriberId xsi:type="ns2:string">28</suscriberId>
<valid xsi:type="ns2:boolean">true</valid>
